blog/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "hu"], ["post_id", 15], ["created_at", "2020-04-07 09:26:11.371638"], ["updated_at", "2020-04-07 09:26:11.371638"], ["user_id", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "hi huda"], ["post_id", 9], ["created_at", "2020-04-06 22:22:21.211898"], ["updated_at", "2020-04-06 22:22:21.211898"]]
---
    def create

        @post=Post.find(params[:post_id])
        @comment=@post.comments.create(comment_params)
        @comment.save