blog/app/controllers/postes_controller.rb

SELECT "postes".* FROM "postes"
---
    def index
    @postes = Poste.all

INSERT INTO "postes" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "test22"], ["created_at", "2020-04-05 12:08:02.482283"], ["updated_at", "2020-04-05 12:08:02.482283"]]
---
    def create
    @poste = Poste.new(poste_params)
    if @poste.save

UPDATE "postes" SET "description" = ?, "updated_at" = ? WHERE "postes"."id" = ?  [["description", "hudhd"], ["updated_at", "2020-04-05 16:20:42.591446"], ["id", 3]]
---
def update
    if @poste.update(poste_params)

DELETE FROM "postes" WHERE "postes"."id" = ?  [["id", 3]]
---
def destroy
    @poste.destroy

SELECT  "postes".* FROM "postes" WHERE "postes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_poste
        @poste = Poste.find(params[:id])