blog/app/controllers/postes_controller.rb

SELECT  "postes".* FROM "postes" WHERE "postes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
     @poste = Poste.find(params[:id])