blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "description", "ingredans", "genger", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["ingredans", ""], ["genger", ""], ["created_at", "2020-04-06 19:47:40.583884"], ["updated_at", "2020-04-06 19:47:40.583884"]]