blog/app/controllers/posts_controller.rb

  def update

      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2020-04-06 22:37:28.279128"], ["id", 11]]